---
kind: method
id: M:Autodesk.Revit.DB.EdgeArrayArray.ReverseIterator
source: html/aacf7bc9-5505-6e46-2ea8-b62c5202d991.htm
---
# Autodesk.Revit.DB.EdgeArrayArray.ReverseIterator Method

Retrieve a backward moving iterator to the array.

## Syntax (C#)
```csharp
public virtual EdgeArrayArrayIterator ReverseIterator()
```

## Returns
Returns a backward moving iterator to the array.